# SpecTypeId.String Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..String Class
SpecTypeId Class Members See Also
---
This class contains constants identifying string specs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static class String
```

Visual Basic
---
```text
Public NotInheritable Class String
```

Visual C++
---
```text
public ref class String abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SpecTypeId..::..String
# See Also
SpecTypeId..::..String Members
Autodesk.Revit.DB Namespace